{
    "database": {
        "collections": {
            "projects": [
                {
                    "id": 0,
                    "name": "Bacon Bit",
                    "link": "https://github.com/Shaylin-8bit/Bacon-Bit",
                    "image": "C.png"
                },
                
                {
                    "id": 1,
                    "name": "Game of Life",
                    "link": "https://github.com/Shaylin-8bit/Conways-Game-of-Life",
                    "image": "Raylib.png"
                },

                {
                    "id": 2,
                    "name": "Portfolio Website",
                    "link": "https://github.com/Shaylin-8bit/website/tree/new-theme",
                    "image": "Node.js.png"
                },

                {
                    "id": 3,
                    "name": "PN Discord Bot",
                    "link": "https://github.com/Shaylin-8bit/ProjectNU-Bot",
                    "image": "Project Nu.png"
                }
            ],

            "posts": [

            ],

            "config": {
                "password": "$2b$10$hnKRinK7S7m3R4XWJOAti.S.H5A/FrXhKWO6SaKVAnMZCNegfkkaS",
                "name": "Malakai \"Shaylin\" C.",
                "bio": [
                    "I am a self taught open source web developer and computer programmer with about two and a half years of experience. I started my journey in early 2020 when I found Codecademy and began diving into programming. Since then I’ve gained experience across a variety of languages including C, C++, Python, and JS.",
                    "Shortly after starting my journey, I joined Codecademy’s community forums and began helping other learners there. I joined the volunteer Super User team in March of 2020 and gained more experience working with the volunteer staff there. I eventually joined the Codecademy Discord’s moderation team, and helped to develop the moderation and utility bot used there.",
                    "After Skillsoft purchased Codecademy, community goals no longer quite lined up, and myself and several other members of the community team left to form the Project Nu community, an entirely free platform designed as a friendly place for programmers of all levels to share and gain knowledge.",
                    "Currently I am continuing to expand my knowledge of the web as I seek to start a career in programming. I also pursue my desire to work at a low level by studying C and x86 assembly, along with the theories behind kernels and operating systems."
                ],
                "miniBio": "Self taught computer programmer and full stack web developer, with a passion for expanding my knowledge and applying it.",
                "quote": {
                    "content": "“Happy is the man that findeth wisdom, and the man that getteth understanding.”",
                    "source": "Proverbs 3:13 KJV"
                }
            }
        }
    }   
}
